<template>
    <div id="J_container">
        <div class="body article">
            <div class="HeaderSuctionTop  ">
                <div class="nav_fix_block"></div>
                <div class="nav_fix_container">
                    <div class="container">
                        <div class="Header w"><a href="#">
                                <div class="Logo">
                                    <div class="Logo_img"></div>
                                </div>
                            </a>
                            <div class="Header_nav">
                                <div class="Header_blackline"></div>
                                <ul>
                                    <li class=""><a class="font_14_fixed">经验沉淀</a>
                                        <div class="Header_nav_li_line"></div>
                                    </li>
                                    <li class=""><a class="font_14_fixed" >设计工具</a></li>
                                    <li class=""><a class="font_14_fixed" >团队介绍</a>
                                        <div class="Header_nav_li_line"></div>
                                    </li>
                                    <li class=""><a class="isSvg"
                                            ><svg width="90px"
                                                height="14px" viewBox="0 0 90 14" version="1.1"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <title>形状</title>
                                                <g id="首页" stroke="none" stroke-width="1" fill="none"
                                                    fill-rule="evenodd">
                                                    <g id="首页(常规)_1280" transform="translate(-268.000000, -39.000000)"
                                                        fill="#6E6E7A" fill-rule="nonzero">
                                                        <g id="菜单" transform="translate(142.000000, 39.000000)">
                                                            <path
                                                                d="M130.193676,9.26233876 C130.193676,10.2530271 129.884793,10.7543392 129.255148,10.7543392 C128.970025,10.7543392 128.732423,10.6349792 128.542342,10.4081951 C128.35226,10.181411 128.221579,9.87107494 128.174059,9.48912283 L126,11.7211555 C126.855367,12.9863719 127.972097,13.6189801 129.338309,13.6189801 C129.789752,13.6189801 130.217436,13.5593 130.63324,13.43994 C131.049043,13.32058 131.417326,13.1534759 131.761849,12.9386279 C132.106372,12.7237798 132.403375,12.4731237 132.652857,12.1747236 C132.902339,11.8763235 133.104301,11.5421154 133.258742,11.1720993 C133.353783,10.9453153 133.413184,10.6707872 133.448824,10.3485151 C133.484464,10.026243 133.508224,9.68009888 133.508224,9.31008277 L133.508224,0.417760124 L130.181796,0.417760124 L130.181796,9.26233876 L130.193676,9.26233876 Z M134.090349,13.2608999 L141.420372,13.2608999 L141.420372,10.3843231 L137.416778,10.3843231 L137.416778,8.23584245 L141.20653,8.23584245 L141.20653,5.44281762 L137.416778,5.44281762 L137.416778,3.18691295 L141.420372,3.18691295 L141.420372,0.417760124 L134.090349,0.417760124 L134.090349,13.2608999 Z M158.824721,3.89113716 L156.448701,0.417760124 L149.237479,0.417760124 L149.237479,10.3843231 L145.328926,10.3843231 L145.328926,0.417760124 L142.002497,0.417760124 L142.002497,13.2608999 L156.579382,13.2608999 L156.579382,10.3843231 L152.563908,10.3843231 L152.563908,0.525184156 L157.149627,7.07805011 L157.149627,13.2608999 L160.476055,13.2608999 L160.476055,7.0661141 L165.156816,0.405824121 L161.188862,0.405824121 L158.824721,3.89113716 Z M185.055986,0.405824121 L176.276591,0.405824121 L176.276591,0.405824121 C175.967708,0.405824121 175.444984,0.465504139 174.755938,0.286464085 C174.066892,0.107424032 173.401606,0.0238720071 172.771961,0.0238720071 C172.094795,0.0238720071 171.47703,0.131296039 170.930545,0.3342081 C170.38406,0.53712016 169.920736,0.823584245 169.540573,1.19360036 C169.16041,1.56361647 168.863407,2.0052486 168.661446,2.53043275 C168.447604,3.04368091 168.352563,3.62854508 168.352563,4.26115327 C168.352563,4.89376146 168.447604,5.43088162 168.649566,5.83670574 C168.851527,6.25446586 169.11289,6.60060997 169.433652,6.87513805 C169.754415,7.14966613 170.122698,7.36451419 170.538502,7.53161824 C170.954305,7.69872229 171.370109,7.84195433 171.797793,7.98518638 C172.154196,8.11648242 172.463078,8.22390645 172.72444,8.33133048 C172.973923,8.43875451 173.187764,8.54617854 173.342206,8.66553858 C173.496647,8.78489862 173.615448,8.91619465 173.686729,9.0594267 C173.758009,9.20265874 173.79365,9.36976279 173.79365,9.56073885 C173.79365,9.88301094 173.662968,10.169475 173.389726,10.4201311 C173.128364,10.6707872 172.72444,10.8020832 172.177956,10.8020832 C171.702752,10.8020832 171.227548,10.6946592 170.740463,10.4798111 C170.253379,10.2649631 169.766295,9.93075496 169.267331,9.48912283 L167.841719,12.1866596 C169.21981,13.1534759 170.716703,13.6428521 172.332397,13.6428521 C173.116484,13.6428521 173.80553,13.535428 174.423295,13.332516 C175.04106,13.1176679 175.563785,12.8312038 175.979588,12.4492517 C176.407272,12.0672996 176.728035,11.6137315 176.941877,11.0766113 C177.167599,10.5394911 177.274519,9.94269096 177.274519,9.28621076 C177.274519,8.30745847 177.025037,7.50774624 176.514193,6.89901005 C176.015229,6.29027387 175.219262,5.80089773 174.126292,5.44281762 C173.85305,5.34732959 173.579808,5.26377757 173.306565,5.19216155 C173.033323,5.10860952 172.783841,5.01312149 172.558119,4.90569746 C172.332397,4.79827343 172.154196,4.66697739 172.023514,4.52374535 C171.892833,4.3805133 171.821553,4.18953725 171.821553,3.96275318 C171.821553,3.62854508 171.952234,3.365953 172.225476,3.16304094 C172.498719,2.96012888 172.843241,2.85270485 173.282805,2.85270485 C173.627328,2.85270485 173.971851,2.92432087 174.340134,3.06755291 C174.696537,3.21078496 175.920188,3.24659297 176.276591,3.24659297 L176.276591,0.871328259 L176.288471,3.19884895 L178.961494,3.19884895 L178.961494,13.2608999 L182.382963,13.2608999 L182.382963,3.19884895 L185.055986,3.19884895 L185.055986,0.405824121 L185.055986,0.405824121 Z M196.270802,1.96944059 C195.653037,1.36070441 194.904591,0.883264263 194.025463,0.525184156 C193.158216,0.179040053 192.207807,-2.84217094e-14 191.174239,-2.84217094e-14 C190.12879,-2.84217094e-14 189.178381,0.179040053 188.311134,0.525184156 C187.455767,0.883264263 186.70732,1.36070441 186.089555,1.96944059 C185.47179,2.59011277 184.984706,3.30627298 184.628302,4.12985723 C184.271899,4.95344147 184.105578,5.84864174 184.105578,6.80352203 C184.105578,7.75840231 184.28378,8.65360258 184.628302,9.47718682 C184.972825,10.3007711 185.45991,11.0288673 186.089555,11.6376035 C186.70732,12.2582756 187.455767,12.7357158 188.323014,13.0818599 C189.190262,13.428004 190.14067,13.6070441 191.186119,13.6070441 C192.219688,13.6070441 193.170096,13.428004 194.037343,13.0818599 C194.904591,12.7357158 195.653037,12.2582756 196.282682,11.6376035 C196.912328,11.0169313 197.399412,10.3007711 197.755815,9.47718682 C198.100338,8.65360258 198.278539,7.75840231 198.278539,6.80352203 C198.278539,5.84864174 198.100338,4.95344147 197.755815,4.12985723 C197.387532,3.30627298 196.900448,2.59011277 196.270802,1.96944059 Z M194.500667,8.23584245 C194.310585,8.66553858 194.049223,9.04749069 193.71658,9.36976279 C193.383938,9.69203489 193.003774,9.94269096 192.56421,10.109795 C192.124647,10.2888351 191.673203,10.3723871 191.186119,10.3723871 C190.699035,10.3723871 190.235711,10.2888351 189.808027,10.109795 C189.368463,9.93075496 188.9883,9.68009888 188.667537,9.36976279 C188.334894,9.04749069 188.073532,8.67747458 187.88345,8.23584245 C187.693369,7.80614632 187.598328,7.32870618 187.598328,6.81545803 C187.598328,6.30220988 187.693369,5.82476973 187.88345,5.39507361 C188.073532,4.96537748 188.334894,4.58342536 188.667537,4.26115327 C189.00018,3.93888117 189.380343,3.7001611 189.808027,3.52112105 C190.247591,3.342081 190.699035,3.25852897 191.186119,3.25852897 C191.673203,3.25852897 192.136527,3.342081 192.56421,3.52112105 C193.003774,3.7001611 193.383938,3.95081718 193.71658,4.26115327 C194.049223,4.58342536 194.310585,4.95344147 194.500667,5.39507361 C194.690749,5.82476973 194.78579,6.30220988 194.78579,6.81545803 C194.78579,7.32870618 194.690749,7.79421032 194.500667,8.23584245 Z M208.661748,12.6282918 L205.121478,7.97325037 C206.036246,7.75840231 206.725292,7.34064219 207.200496,6.731906 C207.66382,6.12316982 207.901422,5.32345758 207.901422,4.34470529 C207.901422,3.79564913 207.818261,3.28240098 207.64006,2.80496084 C207.461858,2.32752069 207.200496,1.90976057 206.855973,1.53974446 C206.51145,1.16972835 206.071886,0.919072274 205.537282,0.70422421 C205.002677,0.489376146 204.384912,0.393888117 203.672106,0.393888117 L198.528022,0.393888117 L198.528022,13.2489639 L201.85445,13.2489639 L201.85445,8.29552247 L204.990797,13.2489639 L215.991771,13.2489639 L215.991771,10.3843231 L211.976297,10.3843231 L211.976297,8.24777846 L215.766049,8.24777846 L215.766049,5.32345758 L211.976297,5.32345758 L211.976297,3.18691295 L215.991771,3.18691295 L215.991771,0.393888117 L208.649868,0.393888117 L208.649868,12.6282918 L208.661748,12.6282918 Z M203.969108,5.7173457 C203.612705,5.99187378 203.113741,6.12316982 202.460335,6.12316982 L201.86633,6.12316982 L201.86633,2.94819288 L202.460335,2.94819288 C203.113741,2.94819288 203.624585,3.07948892 203.969108,3.354017 C204.313631,3.62854508 204.491833,4.0224332 204.491833,4.53568135 C204.491833,5.0489295 204.313631,5.44281762 203.969108,5.7173457 Z"
                                                                id="形状"></path>
                                                        </g>
                                                    </g>
                                                </g>
                                            </svg></a></li>
                                    <li class=""><a class="isSvg" ><svg width="53px"
                                                height="14px" viewBox="0 0 53 14" version="1.1"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <title>形状结合</title>
                                                <g id="首页" stroke="none" stroke-width="1" fill="none"
                                                    fill-rule="evenodd">
                                                    <g id="首页(常规)_1280" transform="translate(-388.000000, -39.000000)"
                                                        fill="#6E6E7A">
                                                        <g id="菜单" transform="translate(142.000000, 39.000000)">
                                                            <path
                                                                d="M253.269073,0.0007 C256.846073,0.0007 258.682407,1.3377 258.367407,3.97903333 C258.346407,4.17036667 258.18074,4.31503333 257.989407,4.31503333 L255.25474,4.31503333 C255.04474,4.31503333 254.879073,4.14703333 254.87674,3.93703333 C254.865073,3.1647 254.328407,2.79136667 253.08474,2.79136667 C251.927407,2.79136667 251.32074,3.19503333 251.192407,3.8577 C251.02674,4.66503333 251.577407,4.94036667 252.82574,5.1597 L253.873407,5.34403333 C256.792407,5.8597 258.169073,7.1617 257.62074,9.78903333 C257.086407,12.3417 254.608407,13.6647 251.374407,13.6647 C247.286407,13.6647 245.65074,11.9053667 246.061407,9.3947 C246.09174,9.21036667 246.248073,9.0727 246.437073,9.0727 L249.239407,9.0727 C249.45874,9.0727 249.62674,9.25703333 249.617407,9.47403333 C249.55674,10.6617 250.462073,10.8717 251.74074,10.8717 C252.99374,10.8717 253.67274,10.4330333 253.79874,9.84503333 C254.00174,8.94436667 253.579407,8.68536667 252.037073,8.43103333 L251.045407,8.26303333 C248.271073,7.8057 246.93174,6.26336667 247.447407,3.7457 C247.84874,1.78103333 249.813407,0.0007 253.269073,0.0007 Z M266.712807,1.00364161e-13 C270.730807,1.00364161e-13 273.41414,2.66233333 272.403807,7.38266667 C271.631473,11.0016667 268.509473,13.664 264.58014,13.664 C260.522473,13.664 257.86014,11.0016667 258.851807,6.26266667 C259.60314,2.66233333 262.727473,1.00364161e-13 266.712807,1.00364161e-13 Z M282.070573,0.294233333 C282.25724,0.294233333 282.415907,0.429566667 282.44624,0.6139 L282.44624,0.6139 L284.36424,12.9339 C284.401573,13.1625667 284.22424,13.3702333 283.990907,13.3702333 L283.990907,13.3702333 L281.10224,13.3702333 C280.910907,13.3702333 280.749907,13.2279 280.726573,13.0389 C280.567907,11.7532333 279.986907,7.04923333 279.720907,4.7719 C279.678907,4.40556667 279.188907,4.31223333 279.011573,4.63656667 C278.534269,5.51801765 277.825005,6.81733916 277.098202,8.14585643 L276.762291,8.75967602 C275.699572,10.7010393 274.669858,12.5770373 274.342573,13.1742333 C274.274907,13.2955667 274.148907,13.3702333 274.01124,13.3702333 L274.01124,13.3702333 L271.220573,13.3702333 C270.928907,13.3702333 270.744573,13.0575667 270.88924,12.8032333 L270.88924,12.8032333 L277.879907,0.485566667 C277.94524,0.366566667 278.07124,0.294233333 278.208907,0.294233333 L278.208907,0.294233333 Z M293.52514,0.294233333 C296.97614,0.294233333 298.79614,2.09323333 298.079807,5.2899 C297.56414,7.60223333 295.398807,9.40356667 292.330473,9.40356667 L292.330473,9.40356667 L291.25714,9.40356667 C291.01914,9.40356667 290.839473,9.1819 290.88614,8.94623333 L290.88614,8.94623333 L291.37614,6.61756667 C291.413473,6.44256667 291.567473,6.3189 291.744807,6.3189 L291.744807,6.3189 L292.533473,6.3189 C293.506473,6.3189 294.297473,5.84056667 294.460807,4.97723333 C294.682473,3.85723333 294.131807,3.3789 293.158807,3.3789 L293.158807,3.3789 L291.261807,3.3789 C291.08214,3.3789 290.92814,3.5049 290.890807,3.6799 L290.890807,3.6799 L288.907473,13.0692333 C288.87014,13.2442333 288.713807,13.3702333 288.53414,13.3702333 L288.53414,13.3702333 L285.63614,13.3702333 C285.395807,13.3702333 285.21614,13.1485667 285.267473,12.9129 L285.267473,12.9129 L287.878473,0.5929 C287.915807,0.4179 288.069807,0.294233333 288.249473,0.294233333 L288.249473,0.294233333 Z M266.28814,3.17566667 C264.507807,3.17566667 263.072807,4.51733333 262.57814,6.741 C262.04614,9.16533333 263.01914,10.486 264.948807,10.486 C266.72914,10.486 268.180473,9.16533333 268.64014,7.01633333 C269.17214,4.51733333 268.215473,3.17566667 266.28814,3.17566667 Z"
                                                                id="形状结合"></path>
                                                        </g>
                                                    </g>
                                                </g>
                                            </svg></a></li>
                                </ul>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <div id="J_Article" tabindex="0">
                <div class="textDetail_wrap">
                    <div class="textDetail">
                        <div class="textDetail_content ">
                            <div class="artTitle">凹凸实验室的过去与未来</div>
                            <div class="artSubTitle">
                                <div class="artSubTitle_date">上传日期：<span class="artSubTitle_date_num">2020.12.25</span>
                                </div>
                                <div class="artSubTitle_focus"><i class="artSubTitle_focus_icon"></i>16095</div>
                            </div>
                            <div class="coverText">凹凸实验室隶属于京东零售用户体验设计部（JDC），成立于 2015 年秋冬之交，诞生自深圳前海之滨，至今已走过 5 个年头，5
                                年的时光穿梭而过，凹凸实验室也不断发展壮大，从曾经专注前端的团队成长为如今涵盖前后端、全栈、算法、测试各类方向的全能型研发团队，工作模式也从传统的人力密集型研发转向创新型平台体系化研发，如今，凹凸的各类技术输出与沉淀在业界影响深远。
                            </div>
                            <div class="artCont">
                                <div class="jelly-markdown article-common-body braft-output-content">
                                    <h2 id="星火">星火</h2>
                                    <p>2015 年，凹凸实验室的前身多终端研发部成立刚好一年，彼时的多终端研发部，虽然是一个拥有 20
                                        多位开发人员的独立前端研发部门，但更多的是在支撑着公司内部的各种业务的研发，从微信手 Q
                                        的购物业务到京东商城的营销活动、拍拍网，以及京东云的大改版，业务的类别五花八门，作为一个工线支持部门，每天在各类业务开发中穿插，协助各类业务需求的开发。</p>
                                    <p>
                                    <div class="lazyimg jelly-image lazyimg_loaded"
                                        style="background: transparent; position: relative; width: 100%; height: auto;">
                                        <img src="https://img11.360buyimg.com/imagetools/jfs/t1/151926/15/11296/94062/5fe43493E9cb21c9a/057e2c31479082a0.jpg"
                                            alt="" style="max-width: 100%;"></div>
                                    </p>
                                    <p>&lt;div style="text-align: center; margin-bottom: 20px; color: #999"&gt;2015
                                        加入凹凸实验室的同仁&lt;/div&gt;

                                    </p>
                                    <p>在此期间，部门也产生了很多精品业务，凭借着在 H5
                                        动画方面的造诣，在京东内部小有名气，每到一些大促的时间节点都能收到很多的业务需求，这让团队开始在京东内部开始崭露头角。</p>
                                    <p>
                                    <div class="lazyimg jelly-image lazyimg_loaded"
                                        style="background: transparent; position: relative; width: 100%; height: auto;">
                                        <img src="https://img11.360buyimg.com/imagetools/jfs/t1/152554/24/10910/536958/5fe2e2dbEe1ef36f6/a53e674e5523e9b9.jpg"
                                            alt="" style="max-width: 100%;"></div>
                                    </p>
                                    <p>&lt;div style="text-align: center; margin-bottom: 20px;"&gt;&lt;a
                                        href="https://cases.aotu.io/"&gt;H5 动画作品合集&lt;/a&gt;&lt;/div&gt;

                                    </p>
                                    <p>在这一阶段我们也产生了很多优秀的文章，不完全列举：</p>
                                    <ul>
                                        <li><a href="https://aotu.io/notes/2015/11/24/project-summary/" target="_blank"
                                                rel="noopener noreferrer">
                                                精致化页面重构
                                            </a>
                                            ，by NONO</li>
                                        <li><a href="https://aotu.io/notes/2015/11/23/css3-animation-to-movie-part_1/"
                                                target="_blank" rel="noopener noreferrer">
                                                以电影之眼看CSS3动画（一）
                                            </a>
                                            ，by 凹凸一姐</li>
                                        <li><a href="https://aotu.io/notes/2015/11/23/css3-animation-to-movie-part_2/"
                                                target="_blank" rel="noopener noreferrer">
                                                以电影之眼看CSS3动画（二）
                                            </a>
                                            ，by 凹凸一姐</li>
                                        <li><a href="https://aotu.io/notes/2016/03/16/optimization/" target="_blank"
                                                rel="noopener noreferrer">
                                                前端优化不完全指南
                                            </a>
                                            ，by 暖暖</li>
                                    </ul>
                                    <p>同时，在沉淀了大量精品的 H5 业务之后，我们也开始尝试打造一个可视化搭建工具 HiPage，通过拖拽搭建的方式就能将沉淀的 H5 动画元素组合出新的 H5
                                        页面，实现快速上线，得到业务方的一阵惊叹。这是我们第一个颇具意义的技术产品，它既服务好了业务方，也满足了我们作为技术人员对技术的追求，同时也为我们埋下了关于团队方向思考的引子。
                                    </p>
                                    <p>
                                    <div class="lazyimg jelly-image lazyimg_loaded"
                                        style="background: transparent; position: relative; width: 100%; height: auto;">
                                        <img src="https://img10.360buyimg.com/imagetools/jfs/t1/142843/1/19879/111274/5fe43493E837d41bf/b3f8fbd463bc2a18.jpg"
                                            alt="" style="max-width: 100%;"></div>
                                    </p>
                                    <p>作为技术团队，我们一直在思考，我们所能做的是否仅仅只是服务好业务就够了？或者换一个角度，作为一个工线部门，我们除了努力把业务做好，还能再做些什么？</p>
                                    <p>2015 年 9
                                        月，一个燥热的周五晚上，在白石洲的鸡煲大排档里，关于上面的问题，关于团队的发展，关于团队的未来，团队里的几位大佬一边吃着鸡煲，一边激烈讨论。最终，留着一头飘逸长发的老黄掐灭手里的烟说道，“我们要做深圳最知名的前端团队”，在场的大家听罢后都陷入了沉思。
                                    </p>
                                    <p>彼时落入大家心中的是一点点星火，似乎点亮一丝丝前方的光明，但是，星星之火，可以燎原。</p>
                                    <p>一个月后，凹凸实验室正式成立，朝着 “要做深圳最知名的前端团队” 这个目标，团队的所有小伙伴都充满干劲。很快，我们和设计师通力合作，设计了沿用至今的团队
                                        Logo。</p>
                                    <p>
                                    <div class="lazyimg jelly-image lazyimg_loaded"
                                        style="background: transparent; position: relative; width: 100%; height: auto;">
                                        <img src="https://img13.360buyimg.com/imagetools/jfs/t1/142157/7/19593/10672/5fe2c1a4E0c2fdf60/db8b3170df17b5a5.png"
                                            alt="" style="max-width: 100%;"></div>
                                    </p>
                                    <p>同时也确定了我们的团队的理念：开放、开源，凹凸实验室的名字也来源于此，这一理念灌注在团队血液中，为之后的技术产品研发奠定基础。全新的团队官网也建立起来了，这个官网承载了不仅仅是团队小伙伴的技术文章，同时也是一个个关于技术梦想的追求。团队内也开始举办各类技术分享、编程马拉松，组织各小组的
                                        Code Review，整个团队的技术氛围开始形成，凹凸如一个蹒跚习步的孩童，不断摸索，不断向前，磕磕碰碰，但不失朝气。</p>
                                    <p>
                                    <div class="lazyimg jelly-image lazyimg_loaded"
                                        style="background: transparent; position: relative; width: 100%; height: auto;">
                                        <img src="https://img10.360buyimg.com/imagetools/jfs/t1/156539/23/1641/303596/5fe2e2daE13b00dc9/f10066df9f55d226.jpg"
                                            alt="" style="max-width: 100%;"></div>
                                    </p>
                                    <p>沉舟侧畔千帆过，病树前头万木春。</p>
                                    <h2 id="成长">成长</h2>
                                    <p>回顾我们思考的疑问，我们在建设一个具有一定规模的前端团队的时候，其目的是否仅仅是服务好业务？</p>
                                    <p>我们给出的答案是否定的。</p>
                                    <p>正如凹凸灵魂导师老黄的文章
                                        <a href="https://zhuanlan.zhihu.com/p/26962085" target="_blank"
                                            rel="noopener noreferrer">
                                            《关于前端团队架构的思考》
                                        </a>
                                        中所说的。
                                    </p>
                                    <blockquote>
                                        <p>这个就好比一个人活着不能止于「有食可进有衣可穿」这种基础的物质条件，团队也同样有「精神层面」的内涵，具体如：</p>
                                        <ul>
                                            <li>影响力</li>
                                            <li>创新力</li>
                                            <li>技术视野</li>
                                        </ul>
                                        <p>这些「精神层面」的东西看似很虚，但实际上会以另外一些形式正向的反馈给团队，间接影响团队服务业务的过程甚至结果。
                                            建设团队在公司内外的影响力，可以营造团队的专业口碑，吸引优秀的专业人才主动加盟，而优秀的人才对于团队高效处理业务需求或研发需求的能力具有促进作用。
                                        </p>
                                    </blockquote>
                                    <p>于是我们开始关注如何服务好业务的同时，提炼我们自己的技术产品，以业务为盾，以技术产品为剑，去打造我们梦想中的技术团队。</p>
                
                                    <h3 id="拥抱开源技术的初心">拥抱开源技术的初心</h3>
                                    <p>依然是 17 年，这一年我们在不断提升业务支持，围绕业务打磨技术产品的同时，在开源上我们也在不断奋进。这一年京东商城的前端主流技术栈还停留在
                                        jQuery，而对于我们的业务来说已经无法忍受 jQuery 带来的研发效率低下的困境，我们开始探索新的技术栈，经过缜密的调研后，开始着手开发类 React
                                        框架
                                        <a href="https://github.com/NervJS/nerv" target="_blank"
                                            rel="noopener noreferrer">
                                            Nerv
                                        </a>
                                        ，在内部业务经过一番验证后，开始在 GitHub 开源。凭借着当时团队大牛澈哥的出口转内销的推广策略，Nerv 开源第一天登上 GitHub 的
                                        trending 榜，迅速斩获了上千 Star，这对于以<strong>开源</strong>为理念的我们来说，无疑是振奋人心的。请参见
                                        <a href="https://aotu.io/notes/2018/03/22/nerv/" target="_blank"
                                            rel="noopener noreferrer">
                                            Nerv - 京东高性能前端框架
                                        </a>
                                        。
                                    </p>
                                    <p>时间匆匆忙忙来到 18 年，彼时对于业务来说又迎来新的挑战，各类小程序平台层出不穷，为了应对业务拓展渠道的需求，我们开始探索多端统一开发解决方案，并迅速推出了
                                        <a href="https://github.com/NervJS/taro" target="_blank"
                                            rel="noopener noreferrer">
                                            Taro
                                        </a>
                                        ，实现开发一次，同时生成多端应用，凭借着对 React 语法的独特支持和一天 3 个版本火线迭代的速度，Taro
                                        成为诸多开发者喜爱的解决方案，帮助很多业务上线多端应用，Taro 也成为凹凸实验室的一张技术名片。请参见
                                        <a href="https://aotu.io/notes/2018/06/07/Taro/" target="_blank"
                                            rel="noopener noreferrer">
                                            多端统一开发框架 - Taro
                                        </a>
                                        。
                                    </p>
                                    <p>
                                    <div class="lazyimg jelly-image lazyimg_loaded"
                                        style="background: transparent; position: relative; width: 100%; height: auto;">
                                        <img src="https://img10.360buyimg.com/imagetools/jfs/t1/140075/8/19806/74046/5fe2c46fE777913bb/26555f69d6d033c0.jpg"
                                            alt="" style="max-width: 100%;"></div>
                                    </p>
                                    <p>&lt;div style="text-align: center; margin-bottom: 20px; color: #999"&gt;Taro
                                        stars 数破 2w 庆祝会&lt;/div&gt;

                                    </p>
                                    <h3 id="向全栈迈进">向全栈迈进</h3>
                                    <p>而为了应对内部业务的数据服务请求，以及内部诸多的自研平台系统，凹凸实验室又自建了后端研发团队，为各大系统平台提供坚实的后端服务，为业务封装各类微服务方便调用，同时也在数次大促节点抗住了流量压力，团队的技术栈已经不再局限于前端了，开始向全栈模式转变。
                                    </p>
                                    <h3 id="平台化转型">平台化转型</h3>
                                    <p>18 年
                                        19年，我们在不断对我们的各类工具系统进行打磨，做好能力储备。而与此同时，中台的概念兴起，我们团队也开始探索设计研发在中台领域的地位，开始打造公司的设计中台。我们深刻地认识到团队除了对人才的培养之外，更应该关注团队研发资产的沉淀，工具、平台系统、研发组件这些都是团队宝贵的研发资产。而除了不断进行研发能力建设和储备的同时，我们应该将这些已有的能力积木串联起来，成体系化地对外进行赋能，从而实现传统的人力密集型研发向创新型平台体系化研发的转变。
                                    </p>
                                    <h2 id="启下">启下</h2>
                                    <p>立足业务，技术储能是过去五年凹凸实验室的主题。</p>
                                    <p>而智能化设计研发体系将绘制凹凸实验室未来 5 年的技术产品的梦想画卷。</p>
                                    <p>接下来我们将通过【凹凸技术揭秘】系列文章，为大家分享、剖析凹凸的关键技术布局，希望能为业界带来更多的思想碰撞，也希望能吸引更多有志青年加入我们，共同实现关于技术关于产品关于团队的梦想。
                                    </p>
                                    <p>年光似鸟翩翩过，世事如棋局局新，唯有不忘初心，坚守本心，方能乘风破浪，济沧海。</p>
                                    <h2 id="其他">其他</h2>
                                    <p>感谢一直关注凹凸实验室的读者，为了提供更优质的内容，希望您能抽出几分钟时间，完成一个小调查，明年凹凸公众号的内容由你决定。
                                        <a href="https://aotu.io/join/" target="_blank" rel="noopener noreferrer">
                                            点击直达
                                        </a>
                                    </p>
                                    <p>加入凹凸实验室开放、开源、专业、有爱、有梦的大家庭？
                                        <a href="https://aotu.io/join/" target="_blank" rel="noopener noreferrer">
                                            点击直达
                                        </a>
                                    </p>
                                    <p>还没有关注「凹凸实验室」的读者们，关注我们吧，我们一个月只有 4 次推送机会，我们很珍惜每一次推送，不会让你失望的。微信搜索「凹凸实验室」关注即可。</p>
                                </div>
                            </div><a data-name="download"></a>
                        </div>
                        <div class="authors floor-common">
                            <div class="authors_title">作者<span class="authors_title_num">2</span></div>
                            <div class="authors_items">
                                <div class="authors_items_nav"></div>
                                <div class="authors_items_list"><a href="/search/all?keyword=5b0ff3a0629834a34b663642"
                                        target="_blank" class="authors_item" rel="noopener noreferrer">
                                        <div class="authors_item_header"><img
                                                src="http://img10.360buyimg.com/ee/s100x100_jfs/t25990/270/571198170/328325/7e5faf5d/5b741001Na90c0413.jpg"
                                                class="authors_item_header_avater">
                                            <div class="author_infos">
                                                <div class="author_infos_name">
                                                    <div class="author_name">honly(立)</div>
                                                </div>
                                                <div class="author_infos_id font_12">ID:5b0ff3a0629834a34b663642#</div>
                                                <div class="author_infos_desc"></div>
                                            </div>
                                        </div><i class="authors_item_line"></i>
                                        <div class="authors_item_bottom"><span class="author_docs font_12">全部创作：<span
                                                    class="author_docs_num">78</span></span><i
                                                class="author_docs_arrow"></i></div>
                                    </a><a href="/search/all?keyword=5b0ff3a0629834a34b66364d" target="_blank"
                                        class="authors_item" rel="noopener noreferrer">
                                        <div class="authors_item_header"><img
                                                src="http://img11.360buyimg.com/ee/s100x100_jfs/t1/71587/18/6540/1034616/5d4928b1E8e792460/533d0837eb011b65.jpg"
                                                class="authors_item_header_avater">
                                            <div class="author_infos">
                                                <div class="author_infos_name">
                                                    <div class="author_name">luckyadam</div>
                                                </div>
                                                <div class="author_infos_id font_12">ID:5b0ff3a0629834a34b66364d#</div>
                                                <div class="author_infos_desc"></div>
                                            </div>
                                        </div><i class="authors_item_line"></i>
                                        <div class="authors_item_bottom"><span class="author_docs font_12">全部创作：<span
                                                    class="author_docs_num">79</span></span><i
                                                class="author_docs_arrow"></i></div>
                                    </a></div>
                                <div class="authors_items_nav"></div>
                            </div>
                        </div>
                        <div class="textDetail_comment floor-common"><a class="textDetail_comment_title font_18"
                                data-name="comment"><span class="textDetail_comment_title_text">评论</span>4</a>
                            <div class="textDetail_comment_comp commentWrap">
                                <div class="comInputWrap">
                                    <div class="comInput_noLogin">请<span class="comInput_noLogin_text">登录</span>后评论
                                    </div>
                                </div>
                                <div class="comItem">
                                    <div class="comItem_wrap  comment_close">
                                        <div class="comItem_com comItemType_0">
                                            <div class="comItem_left">
                                                <div class="comItem_left_avatar">
                                                    <div class="comItem_left_avatar_card"><a
                                                            href="/search/all?keyword=61264c2f084e18017a5d4fe7"
                                                            target="_blank" class="authors_item"
                                                            rel="noopener noreferrer">
                                                            <div class="authors_item_header"><img
                                                                    :src="avater"
                                                                    class="authors_item_header_avater">
                                                                <div class="author_infos">
                                                                    <div class="author_infos_name">
                                                                        <div class="author_name">前端萌新五月天</div>
                                                                    </div>
                                                                    <div class="author_infos_id font_12">
                                                                        ID:61264c2f084e18017a5d4fe7#</div>
                                                                    <div class="author_infos_desc"></div>
                                                                </div>
                                                            </div><i class="authors_item_line"></i>
                                                            <div class="authors_item_bottom"><span
                                                                    class="author_docs font_12">全部创作：<span
                                                                        class="author_docs_num">0</span></span><i
                                                                    class="author_docs_arrow"></i></div>
                                                        </a><i class="comItem_left_avatar_trangle"></i></div><img
                                                        class="comItem_left_avatar_img"
                                                        :src="avater">
                                                </div>
                                                <div class="comItem_left_userInfo">
                                                    <div class="comItem_user">
                                                        <div class="item_user_name font_14_fixed">前端萌新五月天</div>
                                                        <div class="item_user_time font_12">2021/08/25 22:01</div>
                                                    </div>
                                                    <div class="item_cont font_14_fixed">&lt;div style="text-align:
                                                        center; margin-bottom: 20px; color: #999"&gt;2015
                                                        加入凹凸实验室的同仁&lt;/div&gt;
                                                        &lt;div style="text-align: center; margin-bottom:
                                                        20px;"&gt;&lt;a href="https://cases.aotu.io/"&gt;H5
                                                        动画作品合集&lt;/a&gt;&lt;/div&gt;
                                                        &lt;div style="text-align: center; margin-bottom: 20px; color:
                                                        #999"&gt;Taro stars 数破 2w 庆祝会&lt;/div&gt;
                                                        写这个静态页面的同仁是特意把css代码流出的吗 哈哈哈哈哈</div>
                                                </div>
                                            </div>
                                            <div class="comItem_com_interact"><i class="interact_pl"></i>
                                                <div class="interact_comment_like "><i
                                                        class="interact_comment_like_icon"></i><span></span></div>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                                <div class="comItem">
                                    <div class="comItem_wrap  comment_close">
                                        <div class="comItem_com comItemType_0">
                                            <div class="comItem_left">
                                                <div class="comItem_left_avatar">
                                                    <div class="comItem_left_avatar_card"><a
                                                            href="/search/all?keyword=608e56e4a421f60183c6fc57"
                                                            target="_blank" class="authors_item"
                                                            rel="noopener noreferrer">
                                                            <div class="authors_item_header"><img
                                                                    :src="avater"
                                                                    class="authors_item_header_avater">
                                                                <div class="author_infos">
                                                                    <div class="author_infos_name">
                                                                        <div class="author_name">Lxx</div>
                                                                    </div>
                                                                    <div class="author_infos_id font_12">
                                                                        ID:608e56e4a421f60183c6fc57#</div>
                                                                    <div class="author_infos_desc"></div>
                                                                </div>
                                                            </div><i class="authors_item_line"></i>
                                                            <div class="authors_item_bottom"><span
                                                                    class="author_docs font_12">全部创作：<span
                                                                        class="author_docs_num">0</span></span><i
                                                                    class="author_docs_arrow"></i></div>
                                                        </a><i class="comItem_left_avatar_trangle"></i></div><img
                                                        class="comItem_left_avatar_img"
                                                        :src="avater">
                                                </div>
                                                <div class="comItem_left_userInfo">
                                                    <div class="comItem_user">
                                                        <div class="item_user_name font_14_fixed">Lxx</div>
                                                        <div class="item_user_time font_12">2021/05/02 15:38</div>
                                                    </div>
                                                    <div class="item_cont font_14_fixed">🐂B</div>
                                                </div>
                                            </div>
                                            <div class="comItem_com_interact"><i class="interact_pl"></i>
                                                <div class="interact_comment_like "><i
                                                        class="interact_comment_like_icon"></i><span></span></div>
                                            </div>
                                        </div>
                                    </div>
                                </div><button type="button" class="ant-btn commentMore"><span>展开更多</span></button>
                            </div>
                        </div>
                        <div style="height: 80px;"></div>
                    </div>          
                </div>
            </div>
        </div>
    </div>
</template>

<script lang="ts" setup>
import avater from "@/assets/img/avart.svg"
</script>

<style scoped>
#J_container, .body {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: vertical;
    -webkit-box-direction: normal;
    -webkit-flex-direction: column;
    flex-direction: column;
    height: 100%;
}
.nav_fix_container {
    background-color: #fff;
}
.container {
    width: 9.984rem;
    max-width: 1920PX;
    min-width: 1280PX;
    margin: 0 auto;
}
.Header {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    position: relative;
    -webkit-box-pack: justify;
    -webkit-justify-content: space-between;
    justify-content: space-between;
    height: 0.6604rem;
    padding: 40PX 0 0;
}
.w {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    width: 9.282rem;
    max-width: 1785PX;
    min-width: 1225PX;
    margin: 0 auto;
}
a {
    text-decoration: none;
    color: #333;
}
[role=button], a, area, button, input:not([type=range]), label, select, summary, textarea {
    touch-action: manipulation;
}
.Logo {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: vertical;
    -webkit-box-direction: normal;
    -webkit-flex-direction: column;
    flex-direction: column;
    -webkit-box-pack: center;
    -webkit-justify-content: center;
    justify-content: center;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
}
.Logo_img, .Logo_img_tunnel {
    width: 0.7592rem;
    height: 0.364rem;
    background-repeat: no-repeat;
    -webkit-background-size: 100% 100%;
    background-size: 100%;
}
.Logo_img {
    background-image: url(../../../3.0/fonts/2657cea….svg);
}
.Header_nav {
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
    height: 14PX;
    margin-left: 0.312rem;
}

.Header_nav, .Header_nav>ul, .Header_nav>ul li {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
}

.Header_blackline {
    background-color: #000;
}

.Header_blackline {
    width: 10PX;
    height: 3PX;
    margin-right: 30PX;
}
.Header_nav>ul li {
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
    margin-right: 30PX;
}
.Header_nav>ul li>a, .Header_nav>ul li>a svg g {
    -webkit-transition: all .1s linear;
    transition: all .1s linear;
}
.Header_nav>ul li>a {
    font-family: PingFangSC-regular,sans-serif;
    color: #6e6e7a;
}
.font_14, .font_14_fixed {
    font-size: 14PX;
}
.Header_nav>ul li .Header_nav_li_line {
    width: 1px;
    height: 0.0624rem;
    margin-left: 30PX;
    background-color: #999;
    opacity: .5;
}

.textDetail_wrap {
    width: 100%;
    background-color: #fafafa;
    -webkit-box-orient: horizontal;
    -webkit-flex-direction: row;
    flex-direction: row;
    -webkit-box-pack: center;
    -webkit-justify-content: center;
    justify-content: center;
    outline: none;
}
.textDetail_wrap, .textDetail_wrap .textDetail {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-direction: normal;
}
.textDetail_wrap .textDetail {
    margin-left: 150PX;
    width: 1150PX;
    -webkit-box-orient: vertical;
    -webkit-flex-direction: column;
    flex-direction: column;
    -webkit-box-pack: start;
    -webkit-justify-content: flex-start;
    justify-content: flex-start;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
}
.textDetail_content {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: vertical;
    -webkit-box-direction: normal;
    -webkit-flex-direction: column;
    flex-direction: column;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
    background-color: #fff;
    margin-top: 60PX;
    width: 100%;
    padding: 2.312rem 3.312rem 2.208rem;
}
.textDetail_content .artTitle {
    font-size: 36PX;
    font-weight: 700;
    line-height: 52PX;
    color: #0c0b22;
    margin-bottom: 0.104rem;
    width: 100%;
}
.textDetail_content .artSubTitle {
    width: 100%;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: horizontal;
    -webkit-box-direction: normal;
    -webkit-flex-direction: row;
    flex-direction: row;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
    height: 20PX;
    font-size: 14PX;
    font-weight: 300;
    line-height: .104rem;
    color: #9e9ea7;
    margin-bottom: 1.312rem;
}
.textDetail_content .artSubTitle_date {
    margin-right: 20PX;
}

.textDetail_content .artSubTitle_focus_icon {
    display: inline-block;
    width: 16PX;
    height: 16PX;
    margin-bottom: 2PX;
    margin-right: 4PX;
    background-image: url(../../../3.0/fonts/efbd571….svg);
    -webkit-background-size: contain;
    background-size: contain;
    background-position: 50%;
    background-repeat: no-repeat;
}

.textDetail_content .coverText {
    margin-bottom: 3.312rem;
    width: 1052px;
    padding: 1.182rem 7.78rem;
    background-color: #f9f9f9;
    color: #6e6e7a;
    font-size: 16PX;
    line-height: 32PX;
    box-sizing: border-box;
}
.textDetail_content .artCont, .textDetail_content .jelly-image-wrap {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: vertical;
    -webkit-box-direction: normal;
    -webkit-flex-direction: column;
    flex-direction: column;
}
.textDetail_content .artCont {
    width: 100%;
}
.jelly-markdown {
    line-height: 2;
    color: #000;
    font-family: Hiragino Sans GB,arial,helvetica,stheiti,s ans-serif;
}
.braft-output-content {
    font-size: 16PX;
    line-height: 2em;
}
.textDetail_content .article-common-body {
    width: 810px;
    margin: 0 auto;
    border: none!important;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: vertical;
    -webkit-box-direction: normal;
    -webkit-flex-direction: column;
    flex-direction: column;
    -webkit-box-pack: center;
    -webkit-justify-content: center;
    justify-content: center;
}
.braft-output-content blockquote {
    margin: 0 0 0.052rem;
    padding: 0.078rem 0.104rem;
    background-color: #f1f2f3;
    border-left: 0.026rem solid #ccc;
    color: #666;
    font-style: italic;
}
h2,.braft-output-content p{
    margin-bottom: 30px;
}

.textDetail_wrap .textDetail .authors {
    -webkit-box-orient: vertical;
    -webkit-flex-direction: column;
    flex-direction: column;
}
.textDetail_wrap .textDetail .authors, .textDetail_wrap .textDetail .authors_title {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-direction: normal;
}
.textDetail_wrap .textDetail .floor-common {
    width: 100%;
    margin-top: 20PX;
    padding: 40PX 55PX;
    background-color: #fff;
}
.textDetail_wrap .textDetail .authors_title {
    -webkit-box-orient: horizontal;
    -webkit-flex-direction: row;
    flex-direction: row;
    height: 25PX;
    line-height: 25PX;
    font-size: 18PX;
    color: #0c0b22;
    margin-bottom: 20PX;
}
.textDetail_wrap .textDetail .authors_title_num {
    margin-left: 8PX;
}

.textDetail_wrap .textDetail .authors_items {
    width: 1116px;
    height: 183px;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: horizontal;
    -webkit-box-direction: normal;
    -webkit-flex-direction: row;
    flex-direction: row;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
    -webkit-box-pack: justify;
    -webkit-justify-content: space-between;
    justify-content: space-between;
}
.textDetail_wrap .textDetail .authors_items_nav {
    width: 33px;
    height: 150px;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-pack: center;
    -webkit-justify-content: center;
    justify-content: center;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
}
.textDetail_wrap .textDetail .authors_items_list {
    -webkit-box-flex: 1;
    -webkit-flex: 1;
    flex: 1;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-pack: start;
    -webkit-justify-content: flex-start;
    justify-content: flex-start;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
    height: 100%;
}
.authors_item {
    background-color: #fff;
    width: 255px;
    /* height: 150px; */
    border-radius: 10PX;
    -webkit-box-shadow: 0 4PX 15PX 0 rgb(0 0 0 / 4%);
    box-shadow: 0 4PX 15PX 0 rgb(0 0 0 / 4%);
    margin-right: 12px;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: vertical;
    -webkit-box-direction: normal;
    -webkit-flex-direction: column;
    flex-direction: column;
    padding: 24px 20px 20px;
    cursor: pointer;
    -webkit-transition: all .1s linear;
    transition: all .1s linear;
}
.authors_item_header {
    width: 100%;
    height: 73px;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
}
.authors_item_header_avater, .narrow .authors_item_header_avater {
    width: 70PX;
    height: 70PX;
    border-radius: 50%;
}
.authors_item_header_avater {
    margin-right: 16PX;
}
img {
    vertical-align: top;
}
img {
    border: 0;
}
.authors_item_line {
    width: 100%;
    height: 1PX;
    background-color: #efefef;
}
.authors_item_bottom {
    width: 100%;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: horizontal;
    -webkit-box-direction: normal;
    -webkit-flex-direction: row;
    flex-direction: row;
    -webkit-box-pack: justify;
    -webkit-justify-content: space-between;
    justify-content: space-between;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
    margin-top: 15PX;
}
.authors_item_bottom .author_docs {
    line-height: 17PX;
    color: #000;
}
.font_12, .narrow .font_14 {
    font-size: 12PX;
}
.authors_item_header .author_infos_id {
    color: #9e9ea7;
    margin: 5px 0 13px;
    max-width: 116px;
    overflow: hidden;
    text-overflow: ellipsis;
    white-space: nowrap;
}

.textDetail_wrap .textDetail_comment_title {
    height: 25PX;
    line-height: 25PX;
    font-size: 18PX;
    color: #0c0b22;
    margin-left: 10PX;
    margin-bottom: 20PX;
    display: inline-block;
}
.textDetail_wrap .textDetail_comment_title_text {
    margin-right: 8PX;
}
.textDetail_wrap .textDetail_comment_comp {
    padding: 0 10PX;
}
.commentWrap {
    width: 100%;
    background-color: #fff;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: vertical;
    -webkit-box-direction: normal;
    -webkit-flex-direction: column;
    flex-direction: column;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
}
.commentWrap .comInputWrap {
    width: 100%;
    height: 60PX;
    border: 1px solid #8a8a98;
    border-radius: 6PX;
    text-align: center;
    margin-bottom: 20PX;
}
.commentWrap .comInputWrap .comInput_noLogin {
    margin-left: 20PX;
    width: 100%;
    height: 60PX;
    line-height: 60PX;
    font-size: 14PX;
    color: #6e6e7a;
    text-align: left;
}
.commentWrap .comItem {
    width: 100%;
}

.comItem_wrap, .comItem_wrap .comItem_com {
    width: 100%;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
}
.comItem_wrap {
    -webkit-box-orient: vertical;
    -webkit-box-direction: normal;
    -webkit-flex-direction: column;
    flex-direction: column;
    position: relative;
}

.comItem_wrap .comItemType_0 {
    margin: 20PX 0;
}
.comItem_wrap .comItem_com {
    -webkit-box-pack: justify;
    -webkit-justify-content: space-between;
    justify-content: space-between;
    -webkit-box-align: start;
    -webkit-align-items: flex-start;
    align-items: flex-start;
}
.comItem_wrap .comItem_com .comItem_left {
    max-width: 70%;
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-orient: horizontal;
    -webkit-box-direction: normal;
    -webkit-flex-direction: row;
    flex-direction: row;
    -webkit-box-align: start;
    -webkit-align-items: flex-start;
    align-items: flex-start;
}
.comItem_wrap .comItem_com .comItem_left_avatar {
    position: relative;
    width: 40PX;
    height: 40PX;
    margin-right: 20PX;
}
.comItem_wrap .comItem_com .comItem_left_avatar_card {
    position: absolute;
    top: -1.0452rem;
    left: 0;
    width: 1.638rem;
    height: 1.0452rem;
    z-index: 2;
    display: none;
    -webkit-box-orient: vertical;
    -webkit-box-direction: normal;
    -webkit-flex-direction: column;
    flex-direction: column;
}
.comItem_wrap .comItem_com .comItem_left_avatar_img {
    width: 40PX;
    height: 40PX;
    border-radius: 50%;
}
div{
    outline: none;
}
.comItem_wrap .comItem_com .comItem_left_userInfo .comItem_user, .comItem_wrap .comItem_com .comItem_left_userInfo .comItem_user .item_user_wrap {
    display: -webkit-box;
    display: -webkit-flex;
    display: flex;
    -webkit-box-align: center;
    -webkit-align-items: center;
    align-items: center;
}
.comItem_wrap .comItem_com .comItem_left_userInfo .comItem_user {
    margin-bottom: 8PX;
}
.comItem_wrap .comItem_com .comItem_left_userInfo .comItem_user .item_user_name {
    line-height: 1;
    color: #6e6e7a;
}
.comItem_wrap .comItem_com .comItem_left_userInfo .comItem_user .item_user_time {
    line-height: 1;
    color: #9e9ea7;
    margin-left: 10PX;
}

.comItem_wrap .comItem_com .comItem_left_userInfo .item_cont {
    line-height: 1.5;
    color: #000;
}
.ant-btn:not(.ant-btn-circle) {
    height: 30PX;
    padding: 0 26PX;
    border-radius: 15PX;
    border-color: #000;
}
.commentWrap .commentMore {
    background: white;
    width: 240PX;
    height: 40PX;
    border: 1px solid #8a8a98;
    border-radius: 20PX;
    text-align: center;
    line-height: 40PX;
    font-size: 14PX;
    color: #9e9ea7;
    margin-top: 40PX;
    cursor: pointer;
    -webkit-transition: all .1s linear;
    transition: all .1s linear;
}

</style>